Revit 2024 API
Space.DesignHeatingLoad Property
Get or set the Design Heating Load of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double DesignHeatingLoad { get; set; }
Visual Basic
Public Property DesignHeatingLoad As Double
	Get
	Set
Visual C++
public:
property double DesignHeatingLoad {
	double get ();
	void set (double value);
}
Remarks
This property is used to get or set the Design Heating Load of the Space.
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace